## Missing Data

In [3]:
import numpy as np
import pandas as pd

In [5]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [7]:
df = pd.DataFrame(d)

In [9]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [11]:
df.dropna() ## Removal along rows axis = 0

     A    B  C
0  1.0  5.0  1

In [13]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [15]:
 df.dropna(axis=1) # Removal along columns ## Inplace = True, if needed

   C
0  1
1  2
2  3

In [17]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [19]:
df.fillna(value='Sample value')

              A             B  C
0           1.0           5.0  1
1           2.0  Sample value  2
2  Sample value  Sample value  3

In [21]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [23]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## Group By clause in Pandas

### Group by method allows you to group rows of data together and then you can call aggregate functions

In [29]:
data = {'Company':['Google','Microsoft','FB','FB','Google','Microsoft'],
       'Person':['Sam','Amy','Carl','Carl','Sarah','Amy'],
       'Sales':[200,120,500]}

In [31]:
data

{'Company': ['Google', 'Microsoft', 'FB'],
 'Person': ['Sam', 'Amy', 'Carl'],
 'Sales': [200, 120, 500]}

In [41]:
df = pd.DataFrame(data)

In [43]:
df

     Company Person  Sales
0     Google    Sam    200
1  Microsoft    Amy    120
2         FB   Carl    500